import Container from "@mui/material/Container";

function PaymentRequirements() {
  return (
    <div>
      <Container sx={{ marginTop: 2 }} maxWidth="md">
        <h1 style={{ textAlign: "center" }}>ระบบใบชำระเงินการจองใช้ห้อง</h1>
        <h4><u>Requirements</u></h4>
        <p>
        ระบบการชำระเงินเพื่อเข้าใช้บริการห้องของบริษัทRoom Booking เป็นระบบที่ให้สมาชิกระบบจองใช้ห้องสามารถเลือกวิธีชำระเงินผ่านวิธีต่างๆเพื่อทำการจองใช้ห้องต่างๆ ที่สมาชิกต้องการโดยทางพนักงานระบบจะเป็นผู้ยืนยันการชำระเงิน เมื่อชำระเสร็จสิ้นสมาชิกระบบจะสามารถจองใช้งานห้องต่างๆได้ เช่น ห้องเรียนห้องปฏิบัติการ หรือห้องอ่านหนังสือ เป็นต้น
 	นอกจากนี้ ระบบยังทำการแสดงใบชำระค่าใช้จ่าย จะชี้แจงรายระเอียดตัวอย่าง เช่น เลขใบแจ้งหนี้(Invoice Number), ประเภทของการชำระเงิน, ราคาห้องที่จอง , ราคาอาหาร ราคารวมทั้งหมด และวันที่ทำการชำระเงิน
        </p>
        <br />
        
        <h4><u>User Story</u> (ระบบใบชำระเงินการจองใช้ห้อง )</h4>
        <p> 
        <b>ในบทบาทของ</b>	พนักงานระบบ<br />
        <b>ฉันต้องการ</b>	ยืนยันการชำระเงินที่มาจาการใช้งานห้อง<br />
        <b>เพื่อ</b>	 ให้สมาชิกระบบจองใช้ห้องสามารถชำระเงินที่ใช้บริการห้องได้<br />
        </p>
      </Container>

    </div>
  );
}
export default PaymentRequirements;